; ModuleID = 'test.c'
source_filename = "test.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HotData = type { i32, [64 x i8], i32, [64 x i8], i32 }
%struct.anon = type { i32, [32 x i8], i32, [32 x i8], i32 }

@localArray = common global [10 x [10 x i32]] zeroinitializer, align 16, !dbg !0
@hot_array = common global [10 x %struct.HotData] zeroinitializer, align 16, !dbg !6
@hot_data = common global %struct.HotData zeroinitializer, align 4, !dbg !24
@mid_vars = internal global %struct.anon zeroinitializer, align 4, !dbg !26
@var1 = common global i32 0, align 4, !dbg !38
@var2 = common global i32 0, align 4, !dbg !40
@var3 = common global i32 0, align 4, !dbg !42
@var4 = common global i32 0, align 4, !dbg !44
@var6 = common global i32 0, align 4, !dbg !48
@var7 = common global i32 0, align 4, !dbg !50
@var5 = common global i32 0, align 4, !dbg !46
@.str = private unnamed_addr constant [32 x i8] c"\E6\A0\B8\E5\BF\83\E5\8F\98\E9\87\8F\EF\BC\9A\0Aa=%d\0Ab=%d\0Ac=%d\0A\00", align 1
@.str.1 = private unnamed_addr constant [31 x i8] c"\E4\B8\AD\E9\97\B4\E5\8F\98\E9\87\8F\EF\BC\9Ax=%d y=%d z=%d\0A\00", align 1
@.str.2 = private unnamed_addr constant [32 x i8] c"\E5\85\B6\E4\BB\96\E5\8F\98\E9\87\8F\EF\BC\9Avar4=%d var5=%d\0A\00", align 1
@.str.3 = private unnamed_addr constant [26 x i8] c"array: localArray[%d]=%d\0A\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"hot_array = %c\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "localArray", scope: !2, file: !3, line: 22, type: !52, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "test.c", directory: "/mnt/hgfs/graduate/codeProgram/HUAWEIProject/DFG-NewGraph-Changer-main/BBDyAnalysis/input/structArray")
!4 = !{}
!5 = !{!6, !24, !0, !26, !38, !40, !42, !44, !46, !48, !50}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "hot_array", scope: !2, file: !3, line: 18, type: !8, isLocal: false, isDefinition: true)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 11200, elements: !22)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "HotData", file: !3, line: 16, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 10, size: 1120, elements: !11)
!11 = !{!12, !14, !19, !20, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !10, file: !3, line: 11, baseType: !13, size: 32)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !10, file: !3, line: 12, baseType: !15, size: 512, offset: 32)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, elements: !17)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !{!18}
!18 = !DISubrange(count: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !10, file: !3, line: 13, baseType: !13, size: 32, offset: 544)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !10, file: !3, line: 14, baseType: !15, size: 512, offset: 576)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !10, file: !3, line: 15, baseType: !13, size: 32, offset: 1088)
!22 = !{!23}
!23 = !DISubrange(count: 10)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "hot_data", scope: !2, file: !3, line: 20, type: !9, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "mid_vars", scope: !2, file: !3, line: 30, type: !28, isLocal: true, isDefinition: true)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 24, size: 608, elements: !29)
!29 = !{!30, !31, !35, !36, !37}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !3, line: 25, baseType: !13, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !28, file: !3, line: 26, baseType: !32, size: 256, offset: 32)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 256, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !3, line: 27, baseType: !13, size: 32, offset: 288)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !28, file: !3, line: 28, baseType: !32, size: 256, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !28, file: !3, line: 29, baseType: !13, size: 32, offset: 576)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "var1", scope: !2, file: !3, line: 32, type: !13, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "var2", scope: !2, file: !3, line: 32, type: !13, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "var3", scope: !2, file: !3, line: 32, type: !13, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "var4", scope: !2, file: !3, line: 32, type: !13, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "var5", scope: !2, file: !3, line: 32, type: !13, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "var6", scope: !2, file: !3, line: 32, type: !13, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "var7", scope: !2, file: !3, line: 32, type: !13, isLocal: false, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 3200, elements: !53)
!53 = !{!23, !23}
!54 = !{i32 2, !"Dwarf Version", i32 4}
!55 = !{i32 2, !"Debug Info Version", i32 3}
!56 = !{i32 1, !"wchar_size", i32 4}
!57 = !{!"clang version 6.0.0 (tags/RELEASE_600/final)"}
!58 = distinct !DISubprogram(name: "f", scope: !3, file: !3, line: 34, type: !59, isLocal: false, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !2, variables: !4)
!59 = !DISubroutineType(types: !60)
!60 = !{null}
!61 = !DILocalVariable(name: "i", scope: !62, file: !3, line: 35, type: !13)
!62 = distinct !DILexicalBlock(scope: !58, file: !3, line: 35, column: 5)
!63 = !DILocation(line: 35, column: 14, scope: !62)
!64 = !DILocation(line: 35, column: 10, scope: !62)
!65 = !DILocation(line: 35, column: 21, scope: !66)
!66 = distinct !DILexicalBlock(scope: !62, file: !3, line: 35, column: 5)
!67 = !DILocation(line: 35, column: 23, scope: !66)
!68 = !DILocation(line: 35, column: 5, scope: !62)
!69 = !DILocation(line: 36, column: 28, scope: !70)
!70 = distinct !DILexicalBlock(scope: !66, file: !3, line: 35, column: 42)
!71 = !DILocation(line: 36, column: 35, scope: !70)
!72 = !DILocation(line: 36, column: 46, scope: !70)
!73 = !DILocation(line: 36, column: 20, scope: !70)
!74 = !DILocation(line: 36, column: 9, scope: !70)
!75 = !DILocation(line: 36, column: 23, scope: !70)
!76 = !DILocation(line: 36, column: 26, scope: !70)
!77 = !DILocation(line: 37, column: 26, scope: !70)
!78 = !DILocation(line: 37, column: 33, scope: !70)
!79 = !DILocation(line: 37, column: 44, scope: !70)
!80 = !DILocation(line: 37, column: 19, scope: !70)
!81 = !DILocation(line: 37, column: 9, scope: !70)
!82 = !DILocation(line: 37, column: 22, scope: !70)
!83 = !DILocation(line: 37, column: 24, scope: !70)
!84 = !DILocation(line: 38, column: 5, scope: !70)
!85 = !DILocation(line: 35, column: 38, scope: !66)
!86 = !DILocation(line: 35, column: 5, scope: !66)
!87 = distinct !{!87, !68, !88}
!88 = !DILocation(line: 38, column: 5, scope: !62)
!89 = !DILocation(line: 39, column: 1, scope: !58)
!90 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 41, type: !91, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !2, variables: !4)
!91 = !DISubroutineType(types: !92)
!92 = !{!13}
!93 = !DILocation(line: 44, column: 11, scope: !90)
!94 = !DILocation(line: 44, column: 5, scope: !90)
!95 = !DILocation(line: 45, column: 18, scope: !90)
!96 = !DILocation(line: 45, column: 25, scope: !90)
